Revit 2026 API

# GeometryElementGetBoundingBox Method

---

Retrieves a box that encloses the geometry element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BoundingBoxXYZ GetBoundingBox()
```
```vb
Public Function GetBoundingBox As BoundingBoxXYZ
```
```cpp
public:
BoundingBoxXYZ^ GetBoundingBox()
```
```fsharp
member GetBoundingBox : unit -> BoundingBoxXYZ
```

#### Return Value

BoundingBoxXYZThe bounding box.

Note: If the GeometryElement was obtained via Element.get_Geometry from an Element containing 2D geometry but no 3D geometry, the bounding box returned by this function may not be empty because it takes the 2D geometry into account.

#### Reference

GeometryElement Class

Autodesk.Revit.DB Namespace